#### Terraform Format 🖌 ``
#### Terraform Validate 🤖 ``
#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```terraform
module.resource_group[0].data.modtm_module_source.telemetry[0]: Reading...
module.nsg[0].data.modtm_module_source.telemetry[0]: Reading...
module.vm[0].data.modtm_module_source.telemetry[0]: Reading...
module.vnet[0].data.modtm_module_source.telemetry[0]: Reading...
module.nsg[0].random_uuid.telemetry[0]: Refreshing state... [id=3d34366d-e1cd-bbde-fa12-9f393b28e5cf]
module.vm[0].data.modtm_module_source.telemetry[0]: Read complete after 0s
module.vnet[0].random_uuid.telemetry[0]: Refreshing state... [id=4ba1bb2f-ffe9-bccb-1278-cd24a1b9c4c6]
module.vnet[0].data.modtm_module_source.telemetry[0]: Read complete after 0s
module.resource_group[0].data.modtm_module_source.telemetry[0]: Read complete after 0s
module.nsg[0].data.modtm_module_source.telemetry[0]: Read complete after 0s
module.resource_group[0].random_uuid.telemetry[0]: Refreshing state... [id=b1c7e67c-2a02-19f7-f512-2be6902fb706]
module.resource_group[0].azurerm_resource_group.this: Refreshing state... [id=/subscriptions/fb006a95-6e01-4852-8adc-c094db4da08d/resourceGroups/rg-free-demo]
module.resource_group[0].data.azurerm_client_config.telemetry[0]: Reading...
module.vnet[0].data.azurerm_client_config.this: Reading...
module.vnet[0].data.azurerm_client_config.telemetry[0]: Reading...
module.resource_group[0].data.azurerm_subscription.current: Reading...
module.vm[0].data.azurerm_client_config.telemetry[0]: Reading...
module.nsg[0].data.azurerm_client_config.telemetry[0]: Reading...
module.resource_group[0].data.azurerm_client_config.telemetry[0]: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD04NGI4NGM0MS1jZDkxLTRlNjktYmZkNC0xZmI0ZGY5YmEzYjE7b2JqZWN0SWQ9ZDgzYzhhZjktM2MwYS00ZDg0LTk3OTktZmI1N2JhNWQwNzBiO3N1YnNjcmlwdGlvbklkPWZiMDA2YTk1LTZlMDEtNDg1Mi04YWRjLWMwOTRkYjRkYTA4ZDt0ZW5hbnRJZD1mZDhhOTZiYy04NWFjLTRmNzUtOGUxMS02NjEzYjFhYTRmZDM=]
module.vnet[0].data.azurerm_client_config.this: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD04NGI4NGM0MS1jZDkxLTRlNjktYmZkNC0xZmI0ZGY5YmEzYjE7b2JqZWN0SWQ9ZDgzYzhhZjktM2MwYS00ZDg0LTk3OTktZmI1N2JhNWQwNzBiO3N1YnNjcmlwdGlvbklkPWZiMDA2YTk1LTZlMDEtNDg1Mi04YWRjLWMwOTRkYjRkYTA4ZDt0ZW5hbnRJZD1mZDhhOTZiYy04NWFjLTRmNzUtOGUxMS02NjEzYjFhYTRmZDM=]
module.vnet[0].data.azurerm_client_config.telemetry[0]: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD04NGI4NGM0MS1jZDkxLTRlNjktYmZkNC0xZmI0ZGY5YmEzYjE7b2JqZWN0SWQ9ZDgzYzhhZjktM2MwYS00ZDg0LTk3OTktZmI1N2JhNWQwNzBiO3N1YnNjcmlwdGlvbklkPWZiMDA2YTk1LTZlMDEtNDg1Mi04YWRjLWMwOTRkYjRkYTA4ZDt0ZW5hbnRJZD1mZDhhOTZiYy04NWFjLTRmNzUtOGUxMS02NjEzYjFhYTRmZDM=]
module.vm[0].data.azurerm_client_config.telemetry[0]: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD04NGI4NGM0MS1jZDkxLTRlNjktYmZkNC0xZmI0ZGY5YmEzYjE7b2JqZWN0SWQ9ZDgzYzhhZjktM2MwYS00ZDg0LTk3OTktZmI1N2JhNWQwNzBiO3N1YnNjcmlwdGlvbklkPWZiMDA2YTk1LTZlMDEtNDg1Mi04YWRjLWMwOTRkYjRkYTA4ZDt0ZW5hbnRJZD1mZDhhOTZiYy04NWFjLTRmNzUtOGUxMS02NjEzYjFhYTRmZDM=]
module.nsg[0].data.azurerm_client_config.telemetry[0]: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD04NGI4NGM0MS1jZDkxLTRlNjktYmZkNC0xZmI0ZGY5YmEzYjE7b2JqZWN0SWQ9ZDgzYzhhZjktM2MwYS00ZDg0LTk3OTktZmI1N2JhNWQwNzBiO3N1YnNjcmlwdGlvbklkPWZiMDA2YTk1LTZlMDEtNDg1Mi04YWRjLWMwOTRkYjRkYTA4ZDt0ZW5hbnRJZD1mZDhhOTZiYy04NWFjLTRmNzUtOGUxMS02NjEzYjFhYTRmZDM=]
module.vnet[0].modtm_telemetry.telemetry[0]: Refreshing state... [id=f95345a7-ee5c-4478-8283-646f9abc7807]
module.resource_group[0].modtm_telemetry.telemetry[0]: Refreshing state... [id=58757fdc-d7cc-4d42-bfd0-6839879433f4]
module.nsg[0].modtm_telemetry.telemetry[0]: Refreshing state... [id=cf9f42e6-1d5d-4333-b0bd-c53e773ad55d]
module.resource_group[0].data.azurerm_subscription.current: Read complete after 0s [id=/subscriptions/fb006a95-6e01-4852-8adc-c094db4da08d]
module.nsg[0].azurerm_network_security_group.this: Refreshing state... [id=/subscriptions/fb006a95-6e01-4852-8adc-c094db4da08d/resourceGroups/rg-free-demo/providers/Microsoft.Network/networkSecurityGroups/nsg-web]
module.vnet[0].azapi_resource.vnet: Refreshing state... [id=/subscriptions/fb006a95-6e01-4852-8adc-c094db4da08d/resourceGroups/rg-free-demo/providers/Microsoft.Network/virtualNetworks/vnet-free-demo]
module.nsg[0].azurerm_network_security_rule.this["SSH"]: Refreshing state... [id=/subscriptions/fb006a95-6e01-4852-8adc-c094db4da08d/resourceGroups/rg-free-demo/providers/Microsoft.Network/networkSecurityGroups/nsg-web/securityRules/SSH]
module.vnet[0].module.subnet["subnet-public"].azapi_resource.subnet: Refreshing state... [id=/subscriptions/fb006a95-6e01-4852-8adc-c094db4da08d/resourceGroups/rg-free-demo/providers/Microsoft.Network/virtualNetworks/vnet-free-demo/subnets/subnet-public]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.nsg[0].azurerm_network_security_group.this has changed
  ~ resource "azurerm_network_security_group" "this" {
        id                  = "/subscriptions/fb006a95-6e01-4852-8adc-c094db4da08d/resourceGroups/rg-free-demo/providers/Microsoft.Network/networkSecurityGroups/nsg-web"
        name                = "nsg-web"
      ~ security_rule       = [
          + {
              + access                                     = "Allow"
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "22"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "SSH"
              + priority                                   = 1000
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
                # (1 unchanged attribute hidden)
            },
        ]
      + tags                = {}
        # (2 unchanged attributes hidden)
    }

  # module.resource_group[0].azurerm_resource_group.this has changed
  ~ resource "azurerm_resource_group" "this" {
        id         = "/subscriptions/fb006a95-6e01-4852-8adc-c094db4da08d/resourceGroups/rg-free-demo"
        name       = "rg-free-demo"
      + tags       = {}
        # (2 unchanged attributes hidden)
    }

  # module.vnet[0].azapi_resource.vnet has changed
  ~ resource "azapi_resource" "vnet" {
        id                        = "/subscriptions/fb006a95-6e01-4852-8adc-c094db4da08d/resourceGroups/rg-free-demo/providers/Microsoft.Network/virtualNetworks/vnet-free-demo"
        name                      = "vnet-free-demo"
      ~ output                    = {
            id         = "/subscriptions/fb006a95-6e01-4852-8adc-c094db4da08d/resourceGroups/rg-free-demo/providers/Microsoft.Network/virtualNetworks/vnet-free-demo"
          ~ properties = {
              + subnets           = [
                  + {
                      + properties = {
                          + addressPrefixes   = [
                              + "10.0.1.0/24",
                            ]
                          + provisioningState = "Succeeded"
                        }
                    },
                ]
                # (3 unchanged attributes hidden)
            }
            # (1 unchanged attribute hidden)
        }
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.vm[0].azurerm_linux_virtual_machine.this[0] will be created
  + resource "azurerm_linux_virtual_machine" "this" {
      + admin_username                                         = "azureuser"
      + allow_extension_operations                             = true
      + bypass_platform_safety_checks_on_user_schedule_enabled = false
      + computer_name                                          = "vm-web"
      + disable_password_authentication                        = true
      + disk_controller_type                                   = (known after apply)
      + encryption_at_host_enabled                             = false
      + extensions_time_budget                                 = "PT1H30M"
      + id                                                     = (known after apply)
      + location                                               = "eastus"
      + max_bid_price                                          = -1
      + name                                                   = "vm-web"
      + network_interface_ids                                  = (known after apply)
      + patch_assessment_mode                                  = "ImageDefault"
      + patch_mode                                             = "ImageDefault"
      + platform_fault_domain                                  = -1
      + priority                                               = "Regular"
      + private_ip_address                                     = (known after apply)
      + private_ip_addresses                                   = (known after apply)
      + provision_vm_agent                                     = true
      + public_ip_address                                      = (known after apply)
      + public_ip_addresses                                    = (known after apply)
      + resource_group_name                                    = "rg-free-demo"
      + size                                                   = "Standard_B1s"
      + virtual_machine_id                                     = (known after apply)
      + vm_agent_platform_updates_enabled                      = (known after apply)

      + admin_ssh_key {
          + public_key = <<-EOT
                ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQDEjOSWslXXlf5XcB6PQW4Eid+WYuIFVFldMRbBqGBfesHK0aI0JT3NXcDZnDtDLwqB/BiNDTF7JPNwip6XyV+Rs1ZpMMGW4bex7WZwydUyl/+rwmFYjGKsgEfRy3ExJ8CnQScVcQ4On6O04Y7twLCs2Oq1/V5NFpsr6M6yUi0Xbgly1Ox8BX8BifNC/kwF7I9hwrTfrDcONkXlzOnSiuxkJ82km+YDTKVNtfsli92Y3ghlE/zjjGna+NpCcuKbCGH8E86ypXmhX0bEVP0/x7jS4jTLmeFF37p0+IL/GqMpPXvjZdZ/LfSAS3O3rE9Nmmj+fi7ZTM0HSRdryy051IFkGGMC92D1wkU/6HKHAuPfq/PIF566i66eVDs2KpWak0CF4BAIe5buXivvbMWOz0vP36wrHc81QxhnRoY1ksHFSCSjbM8NJ6PLlhtUOz4vWVJnjL8KM0+mLZdFNxidpea7oqbzQddZpby0C626MQ9md9MEAk/m3ukLtXMWSw9SmqZknUMWozRkm0GgD6frANviOFHt9THrWjmY5FWBY7/cLua7xtRaL7AShzkMgJqIAD9vmqM8edG25Wcm34NTs34dfBTYIsNoI+DIn+Pi5r7B8EnwM1OUuINrbX/i5LfT1PSTghhETVwFR7Z5zszUaOOqkeUXT9L8DtmRpCRCwpvnSw== opc@dgc-gitops1
            EOT
          + username   = "azureuser"
        }

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = 30
          + id                        = (known after apply)
          + name                      = "vm-web-osdisk"
          + storage_account_type      = "Standard_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "0001-com-ubuntu-server-focal"
          + publisher = "Canonical"
          + sku       = "20_04-lts-gen2"
          + version   = "latest"
        }

      + termination_notification (known after apply)
    }

  # module.vm[0].azurerm_network_interface.virtualmachine_network_interfaces["nic"] will be created
  + resource "azurerm_network_interface" "virtualmachine_network_interfaces" {
      + accelerated_networking_enabled = false
      + applied_dns_servers            = (known after apply)
      + id                             = (known after apply)
      + internal_domain_name_suffix    = (known after apply)
      + ip_forwarding_enabled          = false
      + location                       = "eastus"
      + mac_address                    = (known after apply)
      + name                           = "vm-web-nic"
      + private_ip_address             = (known after apply)
      + private_ip_addresses           = (known after apply)
      + resource_group_name            = "rg-free-demo"
      + virtual_machine_id             = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "ipconfig1"
          + primary                                            = true
          + private_ip_address                                 = (known after apply)
          + private_ip_address_allocation                      = "Dynamic"
          + private_ip_address_version                         = "IPv4"
          + public_ip_address_id                               = (known after apply)
          + subnet_id                                          = "/subscriptions/fb006a95-6e01-4852-8adc-c094db4da08d/resourceGroups/rg-free-demo/providers/Microsoft.Network/virtualNetworks/vnet-free-demo/subnets/subnet-public"
        }
    }

  # module.vm[0].azurerm_network_interface_security_group_association.this["nic-nsg_association"] will be created
  + resource "azurerm_network_interface_security_group_association" "this" {
      + id                        = (known after apply)
      + network_interface_id      = (known after apply)
      + network_security_group_id = "/subscriptions/fb006a95-6e01-4852-8adc-c094db4da08d/resourceGroups/rg-free-demo/providers/Microsoft.Network/networkSecurityGroups/nsg-web"
    }

  # module.vm[0].azurerm_public_ip.virtualmachine_public_ips["nic-ipconfig1"] will be created
  + resource "azurerm_public_ip" "virtualmachine_public_ips" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 30
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "eastus"
      + name                    = "vm-web-publicip"
      + resource_group_name     = "rg-free-demo"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
      + zones                   = [
          + "1",
          + "2",
          + "3",
        ]
    }

  # module.vm[0].modtm_telemetry.telemetry[0] will be created
  + resource "modtm_telemetry" "telemetry" {
      + ephemeral_number = (known after apply)
      + id               = (known after apply)
      + nonce            = (known after apply)
      + tags             = {
          + "module_source"   = "registry.terraform.io/Azure/avm-res-compute-virtualmachine/azurerm"
          + "module_version"  = "0.19.0"
          + "random_id"       = (known after apply)
          + "subscription_id" = "fb006a95-6e01-4852-8adc-c094db4da08d"
          + "tenant_id"       = "fd8a96bc-85ac-4f75-8e11-6613b1aa4fd3"
        }
    }

  # module.vm[0].random_uuid.telemetry[0] will be created
  + resource "random_uuid" "telemetry" {
      + id     = (known after apply)
      + result = (known after apply)
    }

  # module.vm[0].tls_private_key.this[0] will be created
  + resource "tls_private_key" "this" {
      + algorithm                     = "RSA"
      + ecdsa_curve                   = "P224"
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + private_key_pem               = (sensitive value)
      + private_key_pem_pkcs8         = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
      + rsa_bits                      = 4096
    }

Plan: 7 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ deployment_info     = {
      ~ virtual_machines = [
          + "vm-web",
        ]
        # (3 unchanged attributes hidden)
    }
  ~ virtual_machines    = {
      + vm-web = {
          + id       = (known after apply)
          + location = "eastus"
          + name     = "vm-web"
          + size     = "Standard_B1s"
        }
    }
  + vm_id               = (known after apply)
  + vm_name             = "vm-web"

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.binary

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.binary"

```

</details>

*Pushed by: @iblake*